app/views/questions/_question.html.erb

<p>
	<strong>Posted <%= time_ago_in_words(question.created_at) %></strong><br>
---
INSERT INTO "questions" ("company_id", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["company_id", 2], ["created_at", "2014-09-18 20:00:22.917906"], ["question", "testing\r\n"], ["updated_at", "2014-09-18 20:00:22.917906"]]