app/views/companies/index.html.erb

SELECT "companies".* FROM "companies"  WHERE (created_at BETWEEN '2014-09-12' AND '2014-09-19')
---
      <tbody>
        <% @companies.sort_by{|m| m.company.downcase}.each do |company| %>