app/views/companies/show.html.erb

SELECT "questions".* FROM "questions"  WHERE "questions"."company_id" = ?  [["company_id", 1]]
---
<table class="table table-striped">
	<% @company.questions.each do |question| %>