app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"  WHERE (created_at BETWEEN '2014-09-12' AND '2014-09-19')
---
  def index
    @companies = Company.all

INSERT INTO "companies" ("company", "created_at", "index", "updated_at") VALUES (?, ?, ?, ?)  [["company", "Google"], ["created_at", "2014-09-18 19:03:31.727997"], ["index", 1], ["updated_at", "2014-09-18 19:03:31.727997"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save