app/controllers/questions_controller.rb

SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "questions" ("company_id", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["company_id", 1], ["created_at", "2014-09-18 19:05:24.329718"], ["question", "test"], ["updated_at", "2014-09-18 19:05:24.329718"]]
---
  def create
    @company = Company.find(params[:company_id])
    @question = @company.questions.create(question_params)